# TypePanelsFronNonRectCellsUnlocked Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..TypePanelsFronNonRectCellsUnlocked Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TypePanelsFronNonRectCellsUnlocked { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TypePanelsFronNonRectCellsUnlocked As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TypePanelsFronNonRectCellsUnlocked {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace